Белгипрозем_2017/src/InformationRegisters/ПротоколРаботыСМобильнымиКлиентами/ПротоколРаботыСМобильнымиКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколРаботыСМобильнымиКлиентами</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийПротоколаРаботыСМобильнымКлиентом</types>
    </type>
  </resources>
  <dimensions>
    <name>МобильныйКлиент</name>
    <type>
      <types>ExchangePlanRef.Мобильный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/CommonModules/ПротоколированиеСобытийРаботыМобильныхКлиентов/Module.bsl
// Обработчик регламентного задания УдалениеСтарыхЗаписейПротоколаМобильныхКлиентов.
// Удаляет старые записи протокола работы с мобильными клиентами.
Процедура УдалениеСтарыхЗаписейПротоколаМобильногоКлиента() Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеКлиенты") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Удаляются записи старше 2-х недель
	ГраницаВыборкиЗаписей = ТекущаяДатаСеанса() - 14*24*60*60;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколРаботыСМобильнымиКлиентами.МоментВремени,
		|	ПротоколРаботыСМобильнымиКлиентами.Период,
		|	ПротоколРаботыСМобильнымиКлиентами.МобильныйКлиент
		|ИЗ
		|	РегистрСведений.ПротоколРаботыСМобильнымиКлиентами КАК ПротоколРаботыСМобильнымиКлиентами
		|ГДЕ
		|	ПротоколРаботыСМобильнымиКлиентами.Период <= &Период";
	Запрос.УстановитьПараметр("Период", ГраницаВыборкиЗаписей);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПротоколРаботыСМобильнымиКлиентами.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.МоментВремени = Выборка.МоментВремени;
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.МобильныйКлиент = Выборка.МобильныйКлиент;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры
